{"pageProps":{"post":{"attributes":{"description":"Explore the differences between useMemo and useCallback Hooks in React, as explained by Brian Holt in the Intermediate React v6 course for Frontend Masters. Understand when to use these Hooks for performance optimization and learn about the potential pitfalls of overusing memoization, alongside insights into React Compiler. Enhance your React skills with practical advice on state management and performance enhancement techniques.","keywords":["useMemo","useCallback","React Hooks","performance optimization","memoization","React Compiler","Brian Holt"]},"html":"<h2>useMemo vs useCallback</h2>\n<p>What&#39;s the difference between useCallback and useMemo? Not much. You could actually rewrite our code to look like this and it&#39;d be equivalent.</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-comment\">// render and render2 are functionally equivalent</span>\n<span class=\"hljs-keyword\">const</span> render = <span class=\"hljs-title function_\">useMemo</span>(<span class=\"hljs-function\">() =&gt;</span> <span class=\"hljs-function\">(<span class=\"hljs-params\">text</span>) =&gt;</span> marked.<span class=\"hljs-title function_\">parse</span>(text), []);\n<span class=\"hljs-keyword\">const</span> render2 = <span class=\"hljs-title function_\">useCallback</span>(<span class=\"hljs-function\">(<span class=\"hljs-params\">text</span>) =&gt;</span> marked.<span class=\"hljs-title function_\">parse</span>(text), []);\n</code></pre><p>Notice there&#39;s an extra <code>() =&gt; [fn]</code>. useCallback is only a thin wrapper on useMemo that automatically wraps it in the additional function. It&#39;s otherwise 100% equivalent.</p>\n<h2>What about strings and numbers?</h2>\n<p>If you&#39;re just passing in strings and numbers to a <code>memo</code>ized function, you don&#39;t need useMemo or useCallback since those will just pass the <code>===</code> test already. It&#39;s just objects and functions! So instead of having options as an object, we could have had theme and text as top level props and we could have skipped using useMemo!</p>\n<p>That&#39;s it! While you should use these tools sparingly, they&#39;re handy when you do need them. They let you create a better performance profile when it&#39;s important.</p>\n<h2>Don&#39;t just use memo all the time 🙏</h2>\n<p>As your potential future coworker, please please please don&#39;t just use memo on every function. I know it sounds like a good idea but let me tell you why. When you memoize something, it doesn&#39;t re-render when its props haven&#39;t changed. You&#39;re correct in thinking that is normally true of most components. However I <strong>guarantee</strong> you will start getting bugs of a component not re-rendering when you expect it to, and that is a hard bug to find if it&#39;s an errant memo somewhere in your codebase (spoken by someone who has had to debug this.) Just don&#39;t do it.</p>\n<h2>React Compiler</h2>\n<p>We talk a bit about <a href=\"https://react.dev/learn/react-compiler\">React Compiler</a> in the intro course, but let&#39;s mention it again here. The function of React Compiler is to examine your code and determine what components could be memoized without causing unexpected behavior. So just what I told you not to do? React is actually going to do this for you free. It&#39;s still in a rough alpha but they&#39;re encouraging people to try it out.</p>\n<p><a href=\"https://react-v9.holt.courses/lessons/whats-next/react-compiler\">See my Intro lesson on it</a>.</p>\n","markdown":"\n## useMemo vs useCallback\n\nWhat's the difference between useCallback and useMemo? Not much. You could actually rewrite our code to look like this and it'd be equivalent.\n\n```javascript\n// render and render2 are functionally equivalent\nconst render = useMemo(() => (text) => marked.parse(text), []);\nconst render2 = useCallback((text) => marked.parse(text), []);\n```\n\nNotice there's an extra `() => [fn]`. useCallback is only a thin wrapper on useMemo that automatically wraps it in the additional function. It's otherwise 100% equivalent.\n\n## What about strings and numbers?\n\nIf you're just passing in strings and numbers to a `memo`ized function, you don't need useMemo or useCallback since those will just pass the `===` test already. It's just objects and functions! So instead of having options as an object, we could have had theme and text as top level props and we could have skipped using useMemo!\n\nThat's it! While you should use these tools sparingly, they're handy when you do need them. They let you create a better performance profile when it's important.\n\n## Don't just use memo all the time 🙏\n\nAs your potential future coworker, please please please don't just use memo on every function. I know it sounds like a good idea but let me tell you why. When you memoize something, it doesn't re-render when its props haven't changed. You're correct in thinking that is normally true of most components. However I **guarantee** you will start getting bugs of a component not re-rendering when you expect it to, and that is a hard bug to find if it's an errant memo somewhere in your codebase (spoken by someone who has had to debug this.) Just don't do it.\n\n## React Compiler\n\nWe talk a bit about [React Compiler][compiler] in the intro course, but let's mention it again here. The function of React Compiler is to examine your code and determine what components could be memoized without causing unexpected behavior. So just what I told you not to do? React is actually going to do this for you free. It's still in a rough alpha but they're encouraging people to try it out.\n\n[See my Intro lesson on it][intro].\n\n[compiler]: https://react.dev/learn/react-compiler\n[intro]: https://react-v9.holt.courses/lessons/whats-next/react-compiler\n","slug":"other-perf-questions","title":"Other Perf Questions","section":"Performance Optimizations","icon":"gauge-high","filePath":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/05-performance-optimizations/D-other-perf-questions.md","nextSlug":"/lessons/transitions/what-are-transitions","prevSlug":"/lessons/performance-optimizations/fixing-it"}},"__N_SSG":true}