{"pageProps":{"post":{"attributes":{"description":"Discover the concept of optimistic UI updates in messaging apps, where the user interface reflects message sending before the actual network send, enhancing user experience. This approach, explained by Brian Holt in the Intermediate React v6 course, utilizes hooks like useOptimistic and useTransition to efficiently manage state changes in React applications.","keywords":["optimistic UI","React","Brian Holt","useOptimistic","useTransition"]},"html":"<p>Let&#39;s say you are texting your friend. You open iMessage, WhatsApp, Signal, ICQ, AIM, MSN Messenger etc. What is the actual order of operations?</p>\n<ol>\n<li>You type your message</li>\n<li>You click send</li>\n<li>The message shows up in the log of messages <em>(this is the one we&#39;re interested in)</em></li>\n<li>The message is actually sent over the network</li>\n<li>The recipient receives it</li>\n</ol>\n<p>That #3 is interesting - you get visual feedback in your log of messages as if the message was already sent. In your mind, the message is sent, and the UI reflects that. In reality the message hasn&#39;t even left the device when it&#39;s first rendered that way, so in some ways it&#39;s a bit misleading, but this <strong>optimistic</strong> display of UI is more closely reflects the user&#39;s mental model.</p>\n<p>That&#39;s what we&#39;re talking about, optimistic UI updates - we&#39;re doing some backend work behind the scenes, but we&#39;re going to optimistically show the user that their update was done. This is possible to do without the ready-made hook <code>useOptimistic</code> but it was such a pain before. Now it&#39;s fairly easy to use in conjunction with useTransition (necessary to identify a low priority re-render) to show an intermediary state.</p>\n","markdown":"\nLet's say you are texting your friend. You open iMessage, WhatsApp, Signal, ICQ, AIM, MSN Messenger etc. What is the actual order of operations?\n\n1. You type your message\n1. You click send\n1. The message shows up in the log of messages _(this is the one we're interested in)_\n1. The message is actually sent over the network\n1. The recipient receives it\n\nThat #3 is interesting - you get visual feedback in your log of messages as if the message was already sent. In your mind, the message is sent, and the UI reflects that. In reality the message hasn't even left the device when it's first rendered that way, so in some ways it's a bit misleading, but this **optimistic** display of UI is more closely reflects the user's mental model.\n\nThat's what we're talking about, optimistic UI updates - we're doing some backend work behind the scenes, but we're going to optimistically show the user that their update was done. This is possible to do without the ready-made hook `useOptimistic` but it was such a pain before. Now it's fairly easy to use in conjunction with useTransition (necessary to identify a low priority re-render) to show an intermediary state.\n","slug":"what-are-optimistic-values","title":"What Are Optimistic Values","section":"Optimistic Values","icon":"sun","filePath":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/07-optimistic-values/A-what-are-optimistic-values.md","nextSlug":"/lessons/optimistic-values/the-project","prevSlug":"/lessons/transitions/making-it-work-with-transitions"}},"__N_SSG":true}