{"pageProps":{"post":{"attributes":{"description":"Learn how to use React's useTransition hook to optimize user experience when selecting options with poor network connectivity, ensuring the user interface remains interactive by building a sports score app with delayed API responses, as taught by Brian Holt in the 'Intermediate React v6' course for Frontend Masters.","keywords":["React","useTransition","Brian Holt","Frontend Masters","UI optimization","web development","sports app"]},"html":"<p>You know how your remote has those buttons for streaming services on it? Have you ever accidentally pressed &quot;Uncle Pete&#39;s Streaming Service&quot; instead of &quot;Netflix&quot; and it takes forever to load and you&#39;re held hostage to the unoptimized loading of their crappy app? Really frustrating, right?</p>\n<p>Now think of that happening on a website you&#39;ve been on – you have several options to pick from and you accidentally choose the wrong one, and now you have to wait for the UI to be interactive again for you to be able to correct your mistake. Really annoying, especially on slower sites, slower connections and/or slower devices.</p>\n<p>This is what transitions are for in React. They allow you to keep UIs interactive while loading is happening behind the scene.</p>\n<p>We&#39;re going to build a little app that shows sports scores with an intentionally slow API. We&#39;re going to make it so users who accidentally select the wrong score to look at can still select a new game even while others are loading in the background.</p>\n<p>Most React apps in the past would have just locked the user out of being able to make new choices while data is loading - it&#39;s the easy way to code this up. But with the <code>useTransition</code> hook, this became pretty easy to do. Let&#39;s do it.</p>\n","markdown":"\nYou know how your remote has those buttons for streaming services on it? Have you ever accidentally pressed \"Uncle Pete's Streaming Service\" instead of \"Netflix\" and it takes forever to load and you're held hostage to the unoptimized loading of their crappy app? Really frustrating, right?\n\nNow think of that happening on a website you've been on – you have several options to pick from and you accidentally choose the wrong one, and now you have to wait for the UI to be interactive again for you to be able to correct your mistake. Really annoying, especially on slower sites, slower connections and/or slower devices.\n\nThis is what transitions are for in React. They allow you to keep UIs interactive while loading is happening behind the scene.\n\nWe're going to build a little app that shows sports scores with an intentionally slow API. We're going to make it so users who accidentally select the wrong score to look at can still select a new game even while others are loading in the background.\n\nMost React apps in the past would have just locked the user out of being able to make new choices while data is loading - it's the easy way to code this up. But with the `useTransition` hook, this became pretty easy to do. Let's do it.\n","slug":"what-are-transitions","title":"What Are Transitions","section":"Transitions","icon":"shuffle","filePath":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/06-transitions/A-what-are-transitions.md","nextSlug":"/lessons/transitions/the-project","prevSlug":"/lessons/performance-optimizations/other-perf-questions"}},"__N_SSG":true}