{"pageProps":{"post":{"attributes":{"description":"Explore the new features of React 19, focusing on React Server Components, which enable partial server-side rendering of React components, a feature that facilitates safe database querying directly within React. Discover insights into this cutting-edge technology, stable since 2023 and actively developed since 2022, with guidance from expert Brian Holt. Ideal for developers aiming to leverage the latest advancements in React functionality.","keywords":["React 19","React Server Components","Brian Holt","web development","JavaScript","server-side rendering"]},"html":"<p>Let&#39;s talk about <a href=\"https://react.dev/blog/2024/12/05/react-19\">React 19</a>.</p>\n<p>It came out at the tail end of 2024 officially but really had publicly been worked on <a href=\"https://github.com/reactjs/rfcs/pull/188\">since late 2022</a>. So it&#39;s been worked nearly 3 years and been stable and in production (via Next.js as well as internally at Facebook) since <a href=\"https://nextjs.org/blog/next-14\">late 2023</a>.</p>\n<p>All of this to say: it&#39;s fairly new to <em>stable</em> React but it&#39;s been worked on and shipped via &quot;unstable&quot; channels for nearly 2+ years. We&#39;ve had a lot of time to learn some good and bad patterns, and it&#39;s going to be fun to learn them together with you.</p>\n<p>Primarily we are going to concern ourselves with React Server Components. This is a new way of writing React components that allows your React components to render partially on the server and then to be served in a client side app in React. It&#39;s very cool; it allows you to do things like safely directly query your database from within React, something we couldn&#39;t (or at least shouldn&#39;t) do previously.</p>\n<p>The Complete Intro course does some minor cover of version 19 features and the good news is nothing changed in what I taught - everything I taught stayed stable so no corrections since version was released after v9 of my intro course!</p>\n","markdown":"Let's talk about [React 19][19].\n\nIt came out at the tail end of 2024 officially but really had publicly been worked on [since late 2022][rfc]. So it's been worked nearly 3 years and been stable and in production (via Next.js as well as internally at Facebook) since [late 2023][next].\n\nAll of this to say: it's fairly new to _stable_ React but it's been worked on and shipped via \"unstable\" channels for nearly 2+ years. We've had a lot of time to learn some good and bad patterns, and it's going to be fun to learn them together with you.\n\nPrimarily we are going to concern ourselves with React Server Components. This is a new way of writing React components that allows your React components to render partially on the server and then to be served in a client side app in React. It's very cool; it allows you to do things like safely directly query your database from within React, something we couldn't (or at least shouldn't) do previously.\n\nThe Complete Intro course does some minor cover of version 19 features and the good news is nothing changed in what I taught - everything I taught stayed stable so no corrections since version was released after v9 of my intro course!\n\n[19]: https://react.dev/blog/2024/12/05/react-19\n[rfc]: https://github.com/reactjs/rfcs/pull/188\n[next]: https://nextjs.org/blog/next-14\n","slug":"react-19","title":"React 19","section":"Welcome","icon":"info-circle","filePath":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/01-welcome/C-react-19.md","nextSlug":"/lessons/react-render-modes/client-side-react","prevSlug":"/lessons/welcome/my-setup"}},"__N_SSG":true}